Autodesk.Revit.DB.ATFImportOptions.SetMaterialClassName(System.String)
Sets the material class name to be applied to materials created during import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.ATFImportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ATFImportOptions.GeometryConversionOptions
Specifies the conversion options for import of ATF mesh and ATF solid geometry.
These values can be specified independently and allows Mesh Only, Solid Only,
Mesh then Solid, Solid then Mesh, None.
By default Solids are preferred and Meshes are used as a backup.
Since:
2023

Autodesk.Revit.DB.ATFImportOptions.ExternalDataGUID
The GUID value associated with the import which
identifies the source model.
Since:
2023

Autodesk.Revit.DB.ATFImportOptions.ApplicationId
The GUID value that represents an application ID.
If not specified, the default GUID value is used.
Since:
2023

Autodesk.Revit.DB.ATFImportOptions.DefaultCategoryId
The default Category to be assigned to DirectShapes.
If not specified, Generic Model is used.
Since:
2023

Autodesk.Revit.DB.ATFImportOptions.CreationMode
The criterion used to determine when to produce an Element.
If not specified, one Element for the entire import is used.
Since:
2023

Autodesk.Revit.DB.ATFImportOptions
The import options used to import files via ATF.
Since:
2023